cases/old/on-fsi-2-openSAS/fluid/constant/physicsProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicsProperties;
}

// on-fsi-2 lado FLUIDO: type fluid -> solids4Foam roda no modo fluid-only
// (delegando para pimpleFluid). Acoplamento FSI feito por preCICE.

type    fluid;
